html/gdb_mountainlion.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Fixing GDB in Emacs on Mac OS 10.8 (Mountain Lion)</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-11-14 17:49:50 EST"/>
<meta name="author" content="Rafe Kettler"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />

</head>
<body>
<div id="content">
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div>

<h1 class="title">Fixing GDB in Emacs on Mac OS 10.8 (Mountain Lion)</h1>


<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-30426956-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Getting a new GDB </a></li>
<li><a href="#sec-2">Codesigning </a></li>
<li><a href="#sec-3">Restart your computer. GDB should work properly now. </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Getting a new GDB </h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>
With the update to Mountain Lion, Emacs can no longer correctly interact with gdb. The easiest way to solve this is to install a newer version of GDB.
</li>
<li>
First, you must install HomeBrew (<a href="https://github.com/mxcl/homebrew">https://github.com/mxcl/homebrew</a>). HomeBrew is a package manager for OSX that installs programs from source (similar to ports on BSD). You can install HomeBrew by running




<pre class="example">$ ruby -e "$(curl -fsSkL raw.github.com/mxcl/homebrew/go)"
</pre>



</li>
<li>
Pay attention to what brew tells you. You may need to follow some additional instructions to get brew working. When in doubt, ask brew:




<pre class="example">$ brew doctor
</pre>



</li>
<li>
Install a newer gdb:




<pre class="example">$ brew install gdb
</pre>



</li>
<li>
You're going to have to change your paths to make your machine prefer the newer gdb to the one that came preinstalled. Edit <code>/etc/paths</code> and make sure <code>/usr/local/bin</code> is at the top of the file (if not, remove it from elsewhere and put it on the first line)
</li>
</ul>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Codesigning </h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>
Since gdb has to have more privilege than most programs to manipulate other running programs, it has to be signed.
</li>
<li>
Follow the instructions under "Creating a Certificate" at <a href="http://sourceware.org/gdb/wiki/BuildingOnDarwin#Creating_a_certificate">http://sourceware.org/gdb/wiki/BuildingOnDarwin#Creating_a_certificate</a>. Call it gdb-cert.
</li>
<li>
Now run:




<pre class="example">$ codesign -s gdb-cert gdb
</pre>


</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Restart your computer. GDB should work properly now. </h2>
<div class="outline-text-2" id="text-3">

</div>
</div>
<div id="postamble">
<p class="author"> Author: Rafe Kettler
</p>
<p class="date"> Date: 2012-11-14 17:49:50 EST</p>
<p class="creator">HTML generated by org-mode 7.3 in emacs 24</p>
</div>
</div>
</body>
</html>
